# Ultralytics DFIR-DETR (2512.07078v4) on RT-DETR-R18 layout
# Backbone: DCFAStage | Neck: ANUPNorm + FIRC3 + DPSC | Head: RTDETRDecoder (unchanged)
# Paper training: AdamW lr=1e-4, wd=5e-4, 300 epochs, batch=4, imgsz=640

nc: 80
scales:
  l: [1.00, 1.00, 1024]

backbone:
  - [-1, 1, DCFAStage, [3, 64, 1, True, 1]] # 0 stem
  - [-1, 1, DCFAStage, [64, 64, 1, False, 2]] # 1 P2/4
  - [-1, 1, DCFAStage, [256, 128, 2, False, 2]] # 2 P3/8
  - [-1, 1, DCFAStage, [512, 256, 2, False, 2]] # 3 P4/16
  - [-1, 1, DCFAStage, [1024, 512, 2, False, 2]] # 4 P5/32

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 5
  - [-1, 1, AIFI, [1024, 8]] # 6
  - [-1, 1, Conv, [256, 1, 1]] # 7 Y5

  - [-1, 1, ANUPNorm, [2]] # 8 top-down ANUP
  - [3, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 9 lateral P4
  - [[-2, -1], 1, Concat, [1]] # 10
  - [-1, 1, Conv, [256, 1, 1]] # 11 fuse
  - [-1, 3, FIRC3, [256]] # 12
  - [-1, 1, Conv, [256, 1, 1]] # 13 Y4
  - [-1, 1, DPSC, []] # 14

  - [-1, 1, ANUPNorm, [2]] # 15
  - [2, 1, Conv, [256, 1, 1, None, 1, 1, False]] # 16 lateral P3
  - [[-2, -1], 1, Concat, [1]] # 17
  - [-1, 1, Conv, [256, 1, 1]] # 18 fuse
  - [-1, 3, FIRC3, [256]] # 19 P3 out
  - [-1, 1, DPSC, []] # 20

  - [-1, 1, Conv, [256, 3, 2]] # 21 down
  - [[-1, 13], 1, Concat, [1]] # 22 cat Y4
  - [-1, 3, FIRC3, [256]] # 23 F4
  - [-1, 1, DPSC, []] # 24

  - [-1, 1, Conv, [256, 3, 2]] # 25 down
  - [[-1, 7], 1, Concat, [1]] # 26 cat Y5
  - [-1, 3, FIRC3, [256]] # 27 F5

  - [[19, 23, 27], 1, RTDETRDecoder, [nc]] # P3, P4, P5
