# YOLO11-P2 Detect + SES (P2 only) + DFIR FIRC inside SmallDefectEnhance
# v5/stable: removed P3 FIRC3Lite (layer 25 in full yaml) to avoid BN running_var NaN on FFT magnitude
# Train: model=yolo11n-p2-ses-dfir-stable.yaml  defect_preprocess=none  ses_gain=0

nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, SESInputCache, []] # 0 raw image for CSSG
  - [-1, 1, Conv, [64, 3, 2]] # 1-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 2-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 4-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 6-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 8-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 10
  - [-1, 2, C2PSA, [1024]] # 11

head:
  - [-1, 1, ANUP, [2]] # 12
  - [[-1, 7], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]] # 14

  - [-1, 1, ANUP, [2]] # 15
  - [[-1, 5], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]] # 17 (P3)

  - [-1, 1, ANUP, [2]] # 18
  - [[-1, 3], 1, Concat, [1]]
  - [-1, 2, C3k2, [128, False]] # 20 (P2)

  - [[0, 20], 1, SmallDefectEnhance, [16, 1]] # 21 SES + FIRC on P2 only

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 17], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]] # 24 (P3 head, no FIRC3Lite)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]] # 27 (P4)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]] # 30 (P5)

  - [[21, 24, 27, 30], 1, Detect, [nc]] # Detect(P2-SES, P3, P4, P5)
