# YOLO11-P2 Instance Segmentation + SES(P2) + DFIR FIRC3Lite on P3
# vs stable-seg: 层25 FIRC3Lite，Segment 使用 P3 增强特征(层25)
# 点缺陷: P2 SES 负责极小目标; P3 FIRC 负责 8px 级细节与线缺陷边界
# Train: --preset ses-dfir-seg-p3 --task segment --size m

nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, SESInputCache, []] # 0 raw image for CSSG
  - [-1, 1, Conv, [64, 3, 2]] # 1-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 2-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 4-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 6-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 8-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 10
  - [-1, 2, C2PSA, [1024]] # 11

head:
  - [-1, 1, ANUP, [2]] # 12
  - [[-1, 7], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]] # 14

  - [-1, 1, ANUP, [2]] # 15
  - [[-1, 5], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]] # 17 (P3 FPN)

  - [-1, 1, ANUP, [2]] # 18
  - [[-1, 3], 1, Concat, [1]]
  - [-1, 2, C3k2, [128, False]] # 20 (P2 FPN)

  - [[0, 20], 1, SmallDefectEnhance, [16, 1]] # 21 SES + FIRC on P2

  - [-1, 1, Conv, [128, 3, 2]]
  - [[-1, 17], 1, Concat, [1]]
  - [-1, 2, C3k2, [256, False]] # 24 (P3 PAN pre-DFIR)
  - [-1, 1, FIRC3Lite, [256, 1]] # 25 P3 DFIR refine

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 14], 1, Concat, [1]]
  - [-1, 2, C3k2, [512, False]] # 28 (P4)

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 11], 1, Concat, [1]]
  - [-1, 2, C3k2, [1024, True]] # 31 (P5)

  - [[21, 25, 28, 31], 1, Segment, [nc, 32, 256]] # Segment(P2-SES, P3-FIRC, P4, P5)
